# Об'єкт - сутність яка служить контецнером для зберігання даних і керування доступом до даних.
# Метод - функція яка має можливість керувати і змінювати дані в обєкті до якого належить.
# Атрибут - змінна яка належить даному обєкту.
# Клас - об'єкт з якого створюються нові копії даного об'єкта.
# Абстрактний клас - клас якому дозволяється наслідувати, але створювати новий його екземпляр неможливо.

# Paradigm OOP
=begin
Інкапсуляція - атрибути і методи об'єкта асоціюються з цим об'єктом і область видимості атрибутів і методів по змовчуванню обмежена даним об'єктом.
Наслідування - механізм що дозволяє розширювати раніше визначений об'єкт шляхом додавання нових можливостей. Спосіб повторного використання коду.
Поліморфізм - механізм коли об'єкт наслідує всі методи його класу.
=end

#Variables
=begin
Local variables - починаються з маленької букви або знака _
Global variables - починаються зі знака $
Object variables - починаються зі знака @
Class variables - починаються з двох знаків @
Constants - починаються з великої букви
Pseudo variables: self, nil, __FILE__
# Це коментар
=end

=begin
Також коментар
=end

# Types
=begin
Simple:
  Symbol
  Number
  String
Hash
=end

# Interpolation
a = 1
b = 2
puts "#{a} * #{b} = #{a*b}"

# String
#
`whoami`
`ls -l`
%x[grep -i meta *.html | wc -l]

# Array
$arr = [1, 2, 3]
[1, 2, "String"]
[1, 2, [1, 2], "String"]

# String Array
%w[a b c d e f g]
%w(a b c d e f g)
%w/a b c d e f g/

# Доступ к елементу массива по номеру
val = $arr[0]
puts val

# Hash
$hash = {"cat" => "cats", "dog" => "dogs", "rabbit" => "rabbits"}

# Доступ к елементу hash по номеру
valOfHash = $hash["cat"]
puts valOfHash

# Questions
=begin
Як відбувається механізм множинного наслідування?
=end