# Method
=begin
Метод - функція яка має можливість керувати і змінювати дані в обєкті до якого належить.
=end

Time.mktime(2000, "Aug", 24, 16, 0)

=begin
Кожного разу після виконання метод повертає значення, тому методи можна писати послідовно.
=end

3.succ.to_s
/(x.z).*?(x.z).*?/.match("x1z_1a3_x2z_1b3").to_a[1..3]
3+2.succ

=begin
Деяким методам можна передавати блоки. Їх обертають в конструкцію do end або в фігурні скобки {}

my_array.each do |x|
  some_action
end

File.open(filename) {|f| some_action}

Також методи можуть приймати змінне число аргументів (Example 1 Methods.rb)

receiver.method(arg1, *more_args)
=end

# Іменовані параметри або Ключові аргументи
=begin
Дозволяють задавати значення по замовчуванню і передавати аргументи в довільному порядку (Example 2 Methods.rb)
Якщо передбачене по замовчуванню значення іменовоного параметра в визначенні методу пропущено, то вважається що такий іменований параметр обов'язковий (Example 3 Methods.rb)
=end

# Синглетні методи
=begin
Методи визначені на рівні об'єкту а не класу.
Вони належать до єдиного класу і ніяк не впливають на клас або його суперкласи. (Example 4 Methods.rb)
=end

# load and require
=begin
Директиви load and require це методи, тому їх можна викликати, передаючи в них змінні або вирази як параметри (Example 1 Dynamic_Ruby.rb)
=end

# Умова під час виконання (Example 2 Dynamic_Ruby.rb)
# Менш ресурсозатратна операцыя попередного прикладу (Example 3 Dynamic_Ruby.rb)
