# Відмінності Ruby
=begin
1. В Ruby немає булевого типу. TrueClass i FalseClass - це два різних класи, а об'єкти true i false являються єдиними їх екземплярами.

2.В Ruby немає операторів інкременту і дикременту. Ні в пост ні в пред формі.

3. В різних мовах оператор ділення по модулю для відємних чисел працює по різному
puts (5 % 3) 2
puts (-5 % 3) 1
puts (5 % -3) -1
puts (-5 % -3) -2

4. В Ruby 0 != false "" != false. В Ruby все дорівнює true крім об'єктів false і nil

5. Змінні Ruby не належать ніякому класу, клас є тільки у значень.

6. В Ruby вважається хорошим тономзадавати змінній початкове значення nil. При цьому зі змінною не асоціюється ніякий тип і істинної ініціалізації не відбувається, але аналізатор знає що дане імяналежить змінній, а не методу.

7. ARGV[0] - перший аргументв командному рядку.

8.Більшість операторів Ruby є методами; їх запис в вигляді знаків пунктуації  не більш ніж зручність.
Виключеннями з цього правила є: += -= .. ... ! not && and || or != !~

9. Визначення булевого значення стає відомим тоді, коли його значення істинності стає відомим:
or - коли отримано перше значення true
and - коли отримано перше значення false
=end